from aiogram import Bot, types
from aiogram.dispatcher import Dispatcher
from aiogram.utils import executor
import config

# -----------------------------------------------------------------------------------------------
# --------------------------------------------Настройки и переменные-----------------------------
# -----------------------------------------------------------------------------------------------



bot = Bot(token=config.token)
dp = Dispatcher(bot)



# -----------------------------------------------------------------------------------------------
# --------------------------------------------Начало работы бота---------------------------------
# -----------------------------------------------------------------------------------------------


@dp.message_handler(commands=['start', 'help'])
async def handle_start_help(message: types.Message):
    await message.reply("Привет!\nНапиши мне что-нибудь!")


# -----------------------------------------------------------------------------------------------
# ------------------------------Обработчик поступающих сообщений --------------------------------
# -----------------------------------------------------------------------------------------------


@dp.message_handler()
async def echo_message(msg: types.Message):
    await bot.send_message(msg.from_user.id, msg.text+' Сообщение бота')







executor.start_polling(dp)